<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;

class ScodeSeeder extends Seeder
{


    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        // Schema::dropIfExists('scodes');

        // Schema::create('scodes', function (Blueprint $table) {
        //     $table->id();
        //     $table->string('scode');
        //     $table->string('text');
        //     $table->timestamps();
        // });
        // $table->string('scode');
        // $table->string('error');
        // $table->string('solution');


        $data = [
            [
                "scode" => "00",
                "error" => "Немає помилок.",
                "solution" => ""
            ],
            [
                "scode" => "01",
                "error" => "Збій програмного забезпечення.",
                "solution" => "Вимкніть на декілька секунд банкомат та знову увімкніть."
            ],
            [
                "scode" => "05",
                "error" => "Проблема зв'язку з контролером чіп-карти.",
                "solution" => "Перевірте з'єднання з контролером чіп-карти. Перевірте сам контролер чіп-карти, за потреби замініть його. Зробіть скидання функціональною кнопкою."
            ],
            [
                "scode" => "06",
                "error" => "Проблема зв'язку з чіп-картою або вставлено неправильну чіп-карту (номер чіп-карти не «226-0PR»).",
                "solution" => "Перевірте чіп-карту в контролері, за потреби замініть її. Зробіть скидання функціональною кнопкою."
            ],
            [
                "scode" => "08",
                "error" => "Накопичувач EEPROM відсутній або несправний",
                "solution" => "Перевірте підключення накопичувача EEPROM"
            ],
            [
                "scode" => "09",
                "error" => "Ручка блокування диспенсора відкрита або диспенсер висунутий із сейфа. Диспенсор не знаходиться в положенні видачі.",
                "solution" => "Вставте диспенсер в сейф до упору й характерного клацання. Якщо помилка залишається, перевірте перемикач блокування — за потреби виконайте його калібрування або замініть."
            ],
            [
                "scode" => "10",
                "error" => "Контролер несправний або батарея розряджена.",
                "solution" => "Вимкніть на кілька секунд та знову увімкніть контролер. Перевірте напругу батареї. Якщо помилка залишається, замініть контролер."
            ],
            [
                "scode" => "11",
                "error" => "Відсутнє програмне забезпечення (завантаження).",
                "solution" => "Виконайте завантаження програмного забезпечення. Якщо блимають точки внизу цифр - йде прошивка контролера. зачекайте, поки контролер не вийде в робочий режим."
            ],
            [
                "scode" => "12",
                "error" => "Захисний роз'єднувач розімкнуто.",
                "solution" => "Диспенсер висунутий із сейфа. Вставте диспенсер в сейф до упору й характерного клацання. Якщо помилка залишається, перевірте перемикач блокування — за потреби виконайте його калібрування або замініть."
            ],
            [
                "scode" => "13",
                "error" => "Активовано блокування банкомату",
                "solution" => "Вийміть пачку банкнот із диспенсора. Скиньте блокування банкомату за допомогою спеціальної програми."
            ],
            [
                "scode" => "14",
                "error" => "Відсутня мінімальна конфігурація.",
                "solution" => "Вставте касети та зареєструйте їх. Потрібно щонайменше одна реджект/ретракт касета та одна касета видачі грошей."
            ],
            [
                "scode" => "15",
                "error" => "Плата розподільника касет з недійсним кодуванням, не вставлена ​​або несправна",
                "solution" => "Перевірте проводку до розподільчої плати касети. Перевірте розподільчу плату касети та замініть її за потреби."
            ],
            [
                "scode" => "16",
                "error" => "Недійсне кодування механізму транспортування купюр, що видаються.",
                "solution" => "Замініть диспенсер."
            ],
            [
                "scode" => "17",
                "error" => "Несправний ремінний привід клампу.",
                "solution" => "Гроші залишаються в клампі при видачі або скиданні в диверт касету. Можливо є застрягання купюр у клампі. Розтягнуті ремені або заклинювання редуктора. Якщо проблема повторилася – замініть диспенсор."
            ],
            [
                "scode" => "18",
                "error" => "Застрягання банкнот під час видачі.",
                "solution" => "Під час видачі банкнот було виявлено застрягання банкнот у зонах видачі або у вертикальних модулях або в клампі (фотодатчики PSDx, DDU, PS1, PS18). Перевірте шлях руху банкнот від касет до клампа або відсік для відбракування на наявність застряглих банкнот. Перевірте правильність встановлення штекерних з'єднань на контролері CMD та/або на елементах фотодатчиків. Після цього поверніть диспенсор у сейф у положення видачі. Зробіть при необхідності скидання помилок на контролері. Якщо продовжується відображатися '18' після цього запуску, значить застрягання не було ефективно усунено та/або сталося інше застрягання. Використовуйте команду самотестування щоб перевірити стан фотодатчиків. Якщо повідомляється, що фотодатчик (окрім фотодатчика «касета порожня») «закритий», визначте причину та усуньте помилку. Якщо помилку не вдається визначити та якщо «18» продовжує відображатися після наступного запуску тоді вертикальний модуль, диспенсор або контролер необхідно замінити."
            ],
            [
                "scode" => "19",
                "error" => "Несправний/заблокований кламп.",
                "solution" => "Проблема з рухом клампу або відбувається блокування під час руху. Перевірте підключення шлейфу на контролері та на клампі. Можливе пошкодження шлейфу (часто кламп блокується у напрямку скидання купюр у диверт касету). Можливо проблема з редуктором чи двигунами клампу (при обертанні провідних шестерень відчувається похрускування). Перевірте шляхи руху клампу в районі презентора (особливо хольних банкоматів). За потреби замініть диспенсор."
            ],
            [
                "scode" => "20",
                "error" => "Блокована/несправна стрілка вузла відбраковування (MA2/1, MA2/2, SM1).",
                "solution" => "Перевірте SAT у зоні стрілки вузла відбраковування на наявність застряглих банкнот/залишків банкнот та видаліть, якщо вони є. Перевірте рухливість перемикача стрілки вузла відбраковування, натиснувши та відпустивши ротор у підйомному магніті MA2. Виберіть функцію тестування 2 (механічне випробування) на функціональній кнопці та спостерігайте за активацією стрілки вузла відбраковування. Якщо підйомний магніт MA2 не рухається або рухається не повністю, SAT або контролер необхідно замінити. Якщо магніт рухається з повним ходом, то CMD-V4 можна знову ввести в експлуатацію. Якщо помилка виникає знову через короткий час й якщо причину не можна визначити після повторної перевірки стрілки вузла відбраковування, то SAT або контролер необхідно замінити."
            ],
            [
                "scode" => "21",
                "error" => "Несправна вимірювальна станція (DDU).",
                "solution" => "Перевірте, чи немає заклинювання в зоні вимірювальної станції. Чи підключен вірно шлейф до контролера та чи не пошкоджений він? Якщо помилка залишається - заменіть вимірювальну станцію (DDU)."
            ],
            [
                "scode" => "22",
                "error" => "Несправний підсилювач фотодатчика або ініціалізація фотодатчика не вдалася",
                "solution" => "Перевірте всі шляхи руху банкнот від касет до клампа на наявність застряглих банкнот/залишків банкнот. Після цього поверніть CMD-V4 у сейф у положення видачі. Якщо після цього запуску індикатор стану знову показує '22', тоді необхідно замінити контролер."
            ],
            [
                "scode" => "23",
                "error" => "Роутинг диск (SM2/SM3) несправний/заблокований.",
                "solution" => "Виставте роутинг диски у правильному положенні. Часті прокручування відбуваються коли пролітає нижній закривач клампу через зачипку в момент його закриття. Засуньте SAT у сейф й виконайте другий тест (тест механіки). При повторних збоях - замініть SAT."
            ],
            [
                "scode" => "24",
                "error" => "Реджект/ретракт привід (підйомний магніт) несправний/заблокований (MA6).",
                "solution" => "Вибір жолоба відхилення/відведення в реджект/ретракт касеті не вдалося встановити правильно. Вийміть реджект/ретракт касету та перевірте рухливість блоку відведення в касеті. Перевірте роз'єми на контролері CMD та на підйомному магніті MA6 на правильність посадки. Перевірте фотодатчик на перемикальному важелі на фіксацію посадки. Перемістіть CMD-V4 у сейфі в положення видачі (запобіжний вимикач замкнений). Знову вставте касету та виберіть функцію тестування 2 (механічне випробування) за допомогою функціональної клавіші та контролюйте рух приводу реджект/ретракт касети (MA6). Якщо підйомний магніт не рухається або якщо кінцеві положення важеля не досягнуто (індикація стану 24 ще раз ), тоді SAT або контролер CMD необхідно замінити."
            ],
            [
                "scode" => "25",
                "error" => "Головний двигун (DCM 1) несправний / заблокований",
                "solution" => "Головний двигун (DCM 1) більше не може бути доведений до своєї мінімальної швидкості обертання після короткого часу запуску. Виберіть 1 (скидання) на функціональній клавіші. Двигун намагається запуститися, але чутні лише утруднені робочі шуми: перевірте шляхи проходження банкнот CMD-V4 на наявність значного застрягання банкнот. Чи не злетіли ремені вертикальних модулів? Перевірте вхід у касету RR, щоб побачити, чи там застрягли банкноти. Перемістіть CMD-V4 у сейфі в положення видачі (запобіжний вимикач закритий) та виберіть функцію 2 (механічний тест) на функціональній клавіші після запуску CMD-V4: спостерігайте за робочими шумами та функцією транспортування головного двигуна. Якщо головний двигун не обертається або якщо ця тестова функція знову завершується з відображенням стану 25, вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "26",
                "error" => "Привід колеса відсіку збору, гребінка (SM 9) несправний/заблокований",
                "solution" => "Перевірте SAT у зоні відсіку для збору на наявність застряглих банкнот/залишків банкнот та видаліть їх, якщо вони є. Перемістіть CMD-V4 у сейф в положення видачі (запобіжний вимикач замкнений) та виберіть текстову функцію 2 (механічний тест) за допомогою функціональної клавіші після запуску CMD-V4: якщо ця тестова функція знову завершується з відображенням статусу 26, тоді SAT або контролер необхідно замінити."
            ],
            [
                "scode" => "28",
                "error" => "Помилка шаттера (механіка).",
                "solution" => "Перевірте шаттер на наявність сторонніх предметів, які перешкоджають руху шторки. Чи вільно рухається шторка?Перемістіть CMD-V4 у сейф в положення видачі (запобіжний вимикач замкнений) та виберіть текстову функцію 2 (механічний тест) за допомогою функціональної клавіші та контролюйте рух шторки. Якщо вона намагається відкритись але безуспішно або тестування завершується знову з індикацією стану 28, тоді шаттер або контролер необхідно замінити."
            ],
            [
                "scode" => "29",
                "error" => "Помилка шаттера (вихідний фотодатчик закритий).",
                "solution" => "Перевірте презентер та шаттер на наявність сторонніх предметів, які перешкоджають роботі вихідного фотодатчика. Перевірте роз'єм на CMD-V4 на правильність підключення. Перемістіть CMD-V4 у сейф у положення видачі та виберіть 1 (скидання) за допомогою функціональної клавіші. Виконайте ініціалізацію фотодатчиків. Якщо після запуску знову відображається 29, то шаттер, SAT або контролер необхідно замінити."
            ],
            [
                "scode" => "3x",
                "error" => "Загато збоїв при виведенні банкнот із касети X",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи вірно налаштовані розміри під банкноти?
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 3x продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "31",
                "error" => "Загато збоїв при виведенні банкнот із касети 1",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи вірно налаштовані розміри під банкноти?
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 31 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "32",
                "error" => "Загато збоїв при виведенні банкнот із касети 2",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи вірно налаштовані розміри під банкноти?
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 32 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "33",
                "error" => "Загато збоїв при виведенні банкнот із касети 3",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи вірно налаштовані розміри під банкноти?
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 33 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "34",
                "error" => "Загато збоїв при виведенні банкнот із касети 4",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи вірно налаштовані розміри під банкноти?
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 34 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "4x",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети X.",
                "solution" => "A) Не вдалося витягнути банкноту з касети X або B) Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                Порядок дій у випадку A):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 4x, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                Порядок дій у випадку B):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 4x з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "41",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети 1.",
                "solution" => "A) Не вдалося витягнути банкноту з касети 1 або B) Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                Порядок дій у випадку A):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 41, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                Порядок дій у випадку B):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 41 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "42",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети 2.",
                "solution" => "A) Не вдалося витягнути банкноту з касети 2 або B) Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                Порядок дій у випадку A):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 42, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                Порядок дій у випадку B):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 42 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "43",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети 3.",
                "solution" => "A) Не вдалося витягнути банкноту з касети 3 або B) Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                Порядок дій у випадку A):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 43, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                Порядок дій у випадку B):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 43 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "44",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети 4.",
                "solution" => "A) Не вдалося витягнути банкноту з касети 4 або B) Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                Порядок дій у випадку A):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 44, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                Порядок дій у випадку B):
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 44 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити."
            ],
            [
                "scode" => "5x",
                "error" => "Забагато дефектних банкнот з касети X.",
                "solution" => "Під час видачі банкнот з касети X було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 4x виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер."
            ],
            [
                "scode" => "51",
                "error" => "Забагато дефектних банкнот з касети 1.",
                "solution" => "Під час видачі банкнот з касети 1 було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 41 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер."
            ],
            [
                "scode" => "52",
                "error" => "Забагато дефектних банкнот з касети 2.",
                "solution" => "Під час видачі банкнот з касети 2 було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 42 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер."
            ],
            [
                "scode" => "53",
                "error" => "Забагато дефектних банкнот з касети 3.",
                "solution" => "Під час видачі банкнот з касети 3 було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 43 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер."
            ],
            [
                "scode" => "54",
                "error" => "Забагато дефектних банкнот з касети 4.",
                "solution" => "Під час видачі банкнот з касети 4 було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 44 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер."
            ],
            [
                "scode" => "6x",
                "error" => "Касета X несправна.",
                "solution" => "Дані банкнот, що зберігаються в касеті X, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити."
            ],
            [
                "scode" => "61",
                "error" => "Касета 1 несправна.",
                "solution" => "Дані банкнот, що зберігаються в касеті 1, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити."
            ],
            [
                "scode" => "62",
                "error" => "Касета 2 несправна.",
                "solution" => "Дані банкнот, що зберігаються в касеті 2, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити."
            ],
            [
                "scode" => "63",
                "error" => "Касета 3 несправна.",
                "solution" => "Дані банкнот, що зберігаються в касеті 3, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити."
            ],
            [
                "scode" => "64",
                "error" => "Касета 4 несправна.",
                "solution" => "Дані банкнот, що зберігаються в касеті 4, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити."
            ],
            [
                "scode" => "70",
                "error" => "Вимірювальна станція (DDU) не готова до роботи.",
                "solution" => "Перевірте, чи немає заклинювання в зоні вимірювальної станції. Чи забруднена вимірювальна станція або чи підключені кабелі? Замініть вимірювальну станцію DDU або контролер."
            ],
            [
                "scode" => "7x",
                "error" => "Датчик видачі брудний або датчик тиску несправний.",
                "solution" => "A) Якщо касету можна встановити в позицію касети 'x' без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик 'датчик видачі' в блоці видачі 'x' (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо розгорнути касету в позиції касети 'x' (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити після перевірки контролерів та датчиків тиску (PSDx)."
            ],
            [
                "scode" => "71",
                "error" => "Датчик видачі брудний або датчик тиску несправний.",
                "solution" => "A) Якщо касету можна встановити в позицію касети 1 без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик 'датчик видачі' в блоці видачі 1 (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо розгорнути касету в позиції касети 1 (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити після перевірки контролерів та датчиків тиску (PSDx)."
            ],
            [
                "scode" => "72",
                "error" => "Датчик видачі брудний або датчик тиску несправний.",
                "solution" => "A) Якщо касету можна встановити в позицію касети 2 без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик 'датчик видачі' в блоці видачі 2 (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо розгорнути касету в позиції касети 2 (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити після перевірки контролерів та датчиків тиску (PSDx)."
            ],
            [
                "scode" => "73",
                "error" => "Датчик видачі брудний або датчик тиску несправний.",
                "solution" => "A) Якщо касету можна встановити в позицію касети 3 без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик 'датчик видачі' в блоці видачі 3 (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо розгорнути касету в позиції касети 3 (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити після перевірки контролерів та датчиків тиску (PSDx)."
            ],
            [
                "scode" => "74",
                "error" => "Датчик видачі брудний або датчик тиску несправний.",
                "solution" => "A) Якщо касету можна встановити в позицію касети 4 без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик 'датчик видачі' в блоці видачі 4 (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо розгорнути касету в позиції касети 4 (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити після перевірки контролерів та датчиків тиску (PSDx)."
            ],
            [
                "scode" => "8x",
                "error" => "Датчик порожньої касети PSEx брудний.",
                "solution" => "Очистіть фотодатчик «PSEx» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "81",
                "error" => "Датчик порожньої касети PSE1 брудний.",
                "solution" => "Очистіть фотодатчик «PSE1» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "82",
                "error" => "Датчик порожньої касети PSE2 брудний.",
                "solution" => "Очистіть фотодатчик «PSE2» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "83",
                "error" => "Датчик порожньої касети PSE3 брудний.",
                "solution" => "Очистіть фотодатчик «PSE3» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "84",
                "error" => "Датчик порожньої касети PSE4 брудний.",
                "solution" => "Очистіть фотодатчик «PSE4» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "90",
                "error" => "Фотодатчик PS1 брудний (вхід колеса укладача, під стрілкою відбракування).",
                "solution" => "Обережно очистіть передавальні та приймальні діоди між колесами укладача (знизу гребінки) за допомогою м'якої щітки, ватних паличок або стисненого повітря. Поверніть CMD-V4 у положення для видачі. Якщо на дисплеї стану продовжується відображати код помилки '90' після запуску (скидання), вийміть SAT та очистіть поверхні призми знизу, між колесами укладача, поверніть CMD-V4 у положення для видачі.
                Якщо на дисплеї стану продовжує відображатися код помилки '90' після запуску (скидання), тоді SAT необхідно замінити. Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування 'DYK' (Запит стану фотодатчиків, підсилювачів фотодатчиків). Фотодатчики, які мають стан '3' або вище, необхідно очистити. Покращення стану можна досягти після повторної ініціалізації фотодатчиків.
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена, при подальшому зростанні забруднення."
            ],
            [
                "scode" => "91",
                "error" => "Фотодатчик PS18 забруднений (знизу гребінки).",
                "solution" => "Фотодатчик PS18 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (Скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '91', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "93",
                "error" => "Фотодатчик PS2 забруднений (відсік відбракування).",
                "solution" => "Фотодатчик PS2 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (Скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '93', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "95",
                "error" => "Фотодатчик PS27 забруднений (шаттер).",
                "solution" => "Фотодатчик PS27 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (Скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '95', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ],
            [
                "scode" => "9A",
                "error" => "Фотодатчик PS28 забруднений (шаттер).",
                "solution" => "Фотодатчик PS28 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (Скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '9A', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення."
            ]
        ];

        DB::table('scodes')->insert($data);
    }
}
