<?php

namespace Database\Seeders\Scode;

use Illuminate\Support\Facades\DB;
use Illuminate\Database\Seeder;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class ControllerFunctionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::dropIfExists('scode_controller_functions');

        Schema::create('scode_controller_functions', function (Blueprint $table) {
            $table->id();
            $table->string('function');
            $table->string('name');
            $table->text('description');
        });

        $data = [
            [
                "function" => "1",
                "name" => "Перезавантаження контролера",
                "description" => "Виконується перезавантаження контролера та перевірка основних компонентів. У разі виявлення несправностей (наприклад, механічних пошкоджень вузлів або забруднення датчиків), що перешкоджають роботі диспенсера, на індикатор стану виводиться відповідне повідомлення про несправність або попередження. Даний тест ідентичний запуску під час задвигання диспенсера в позицію видачі (замикання захисного роз’єднувача)"
            ],
            [
                "function" => "2",
                "name" => "Загальний тест + перезавантаження контролера",
                "description" => "Під час цього тесту послідовно задіюються механічні компоненти CMD-V4. Виявлений збій відображається на індикаторі стану. Зверніть увагу, що функціонування підйомних магнітів стрілочного приводу вузла відбракування, гребінки в зоні клампа, а також електромагнітних муфт V-модулів кожного пікера може бути перевірене лише візуально. Якщо тест завершується без збоїв, виконується перезавантаження контролера."
            ],
            [
                "function" => "3",
                "name" => "Пробне вилістування банкноти + перезавантаження контролера",
                "description" => "У цьому тесті перевіряються шляхи проходження банкнот і функція вилістування всіх задіяних та заповнених банкнотами касет. Спочатку вилістується банкнота з найверхньої касети та транспортується захватом у реджект-відсік диверта. Потім вилістовується по одній банкноті з усіх касет. Ці банкноти також транспортуються до реджект-відсіку диверта. Повідомлення про виявлений збій виводиться на індикатор стану. Якщо тест завершується без збоїв, виконується перезавантаження контролера."
            ],
            [
                "function" => "4",
                "name" => "Відображення версії вбудованого ПЗ контролера",
                "description" => "Чотиризначна версія програмного забезпечення контролера відображається почергово — спочатку перші дві цифри протягом 1 секунди, після цього наступні дві цифри протягом 1 секунди. Після дев’яти повторів відбувається повернення в нормальний режим."
            ],
            [
                "function" => "5",
                "name" => "Обнулення статистичного лічильника",
                "description" => "Лічильник, що обнуляється, встановлюється на 0, а поточна дата реального часу зберігається."
            ],
            [
                "function" => "6",
                "name" => "Активація / деактивація криптування",
                "description" => "Якщо двері сейфа відчинені, виконується активація / деактивація криптування між контролером та системним блоком."
            ],
            [
                "function" => "8",
                "name" => "Ініціалізація датчиків диспенсера",
                "description" => "Виконується ініціалізація всіх датчиків диспенсера, перевіряються та калібруються опорні значення. Є обов’язковою процедурою під час виконання заміни будь-яких компонентів диспенсера. Для тривалої та стабільної роботи оптичних датчиків перед ініціалізацією необхідно переконатися в їх чистоті."
            ]
        ];
        
        DB::table('scode_controller_functions')->insert($data);
    }
}
