<?php

namespace Database\Seeders\Scode;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;

class ScodeListScodesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        Schema::dropIfExists('scode_list_scodes');

        Schema::create('scode_list_scodes', function (Blueprint $table) {
            $table->id();
            $table->string('scode');
            $table->string('error');
            $table->text('solution');
            $table->text('comment')->nullable();
        });

        $data = [
            [
                "scode" => "00",
                "error" => "Без збоїв",
                "solution" => "",
                'comment' => ""
            ],
            [
                "scode" => "01",
                "error" => "Збій програмного забезпечення",
                "solution" => "Вимкніть і знову увімкніть банкомат",
                'comment' => "Можна просто перезавантажити контролер. Якщо помилка з'являється й надалі - замінити контролер.
                <br><br>Напруга на батарейці повинна бути 3,6 В."
            ],
            [
                "scode" => "05",
                "error" => "Проблема зв'язку з контролером чіп-карти",
                "solution" => "Перевірте з'єднання з контролером чіп-карти. Перевірте сам контролер чіп-карти, за потреби замініть його. Зробіть скидання функціональною кнопкою.",
                'comment' => null
            ],
            [
                "scode" => "06",
                "error" => "Проблема зв'язку з чіп-картою або вставлено неправильну чіп-карту (номер чіп-карти не «226-0PR»)",
                "solution" => "Перевірте чіп-карту в контролері, за потреби замініть її. Зробіть скидання функціональною кнопкою.",
                'comment' => null
            ],
            [
                "scode" => "08",
                "error" => "Накопичувач EEPROM відсутній або несправний",
                "solution" => "Перевірте підключення накопичувача EEPROM",
                'comment' => null
            ],
            [
                "scode" => "09",
                "error" => "Перемикач блокування диспенсора розімкнуто. Диспенсор не знаходиться в положенні видачі.",
                "solution" => "Вставте диспенсер в сейф до упору й характерного клацання. Якщо помилка залишається, перевірте перемикач блокування — за потреби виконайте його калібрування або замініть.",
                'comment' => "Диспенсор висунутий з сейфу. Засуньте диспенсер в сейв до упора.
                <br><br>Це перемикач спереду стекера, який замикається штоком у сейфі під час засуву диспенсора."
            ],
            [
                "scode" => "10",
                "error" => "Контролер несправний або батарея розряджена",
                "solution" => "При включенні контролера тестова утіліта виявили серйозні проблеми в роботі електроники.",
                'comment' => "Вимкніть на кілька секунд та знову увімкніть контролер. Перевірте напругу батареї (вона становить 3,6 В). Якщо помилка залишається, замініть контролер."
            ],
            [
                "scode" => "11",
                "error" => "Відсутнє програмне забезпечення (завантаження)",
                "solution" => "Перезавантажити прошивку.",
                'comment' => "Виконайте завантаження прошивки контролера. Якщо блимають точки внизу цифр - йде прошивка контролера. Зачекайте приблизно 15 хв, поки контролер не вийде в робочий режим."
            ],
            [
                "scode" => "12",
                "error" => "Захисний роз'єднувач розімкнуто",
                "solution" => "Задвиньте диспенсер в сейф",
                'comment' => "Диспенсер висунутий із сейфа. Вставте диспенсер в сейф до упору й характерного клацання. Якщо помилка залишається, перевірте перемикач блокування — за потреби виконайте його калібрування або замініть. Цей перемикач знаходиться ззаду диспенсера на лівій рейці."
            ],
            [
                "scode" => "13",
                "error" => "Активовано блокування банкомату",
                "solution" => "Вийміть пачку банкнот із диспенсора. Скиньте блокування банкомату за допомогою спеціальної програми.",
                'comment' => "Блокування роботи диспенсора можливе наприклад при двох ретрактах."
            ],
            [
                "scode" => "14",
                "error" => "Відсутня мінімальна конфігурація",
                "solution" => "Вставте касети та зареєструйте їх. Потрібно щонайменше одна реджект/ретракт касета та одна касета видачі грошей.",
                'comment' => "Може виникати коли банкомат без касет / незареєстрованих касет або коли касети пусті"
            ],
            [
                "scode" => "15",
                "error" => "Плата розподільника касет з недійсним кодуванням, не вставлена ​​або несправна",
                "solution" => "",
                'comment' => null
            ],
            [
                "scode" => "16",
                "error" => "Недійсне кодування механізму транспортування купюр",
                "solution" => "",
                'comment' => null
            ],
            [
                "scode" => "17",
                "error" => "Несправний ремінний привід клампу",
                "solution" => "Замініть диспенсор або контролер",
                'comment' => "
                Гроші залишаються в клампі при видачі або скиданні в диверт касету. Застрягання купюр у клампі. Розбираємось по пунктам.
                <br><br>
                1. Часті проблеми це розтягнуті (порвані) ремені, переломи шлейфу біля клампа (в позиції скидання в диверт-касету можна побачити місце залому шлейфа), погані контакти шлейфу в роз'ємі X13 до контролера  або клампа.
                <br><br>
                2. Якщо при тестуванні кламп взагалі не рухається - перевірити підключення шлейфу клампа до роз'єм X13 контролера (синій ущільнювач на шлейфі в сторону стекера).
                <br><br>
                3. Знос пластикових засувок по сторонам клампа - зменьшується притискання при закритому клампі. Обов'язково протестувати з однією та 40 купюрами декілька разів. Можна витягнути кламп, спробувати закрити однією рукою притиснувши посередині в металеву пластину й подивитись на роботу засувок візуально.
                <br><br>
                4. Проблеми з двигунами (редуктором) коли дуже слабо рухає ремені. Або перетягнуті болти по боках двигуна або двигун вже не видає необхіднк потужність.
                <br><br>
                5. Проблеми з контролером також можут впливати на роботу клампа, але ці проблеми рідкісні й розглядаються в останню чергу.
                <br><br>
                6. В холодну пору - перевірити роботу штатного обігрівоча. Двигуни й ремені замерзають при низьких температурах.
                <br><br>
                Якщо при діагностиці й тестуванні були виявлені проблеми з клампом - ремонт тільки в сервісному центрі."
            ],
            [
                "scode" => "18",
                "error" => "Застрягання банкнот під час видачі",
                "solution" => "Під час видачі банкнот було виявлено застрягання банкнот у зонах видачі або у вертикальних модулях або в клампі (фотодатчики PSDx, DDU, PS1, PS18). Перевірте шлях руху банкнот від касет до клампа або відсік для відбракування на наявність застряглих банкнот. Перевірте правильність встановлення штекерних з'єднань на контролері CMD та/або на елементах фотодатчиків. Після цього поверніть диспенсор у сейф у положення видачі. Зробіть при необхідності скидання помилок на контролері. Якщо продовжується відображатися '18' після цього запуску, значить застрягання не було ефективно усунено та/або сталося інше застрягання. Використовуйте команду самотестування щоб перевірити стан фотодатчиків. Якщо повідомляється, що фотодатчик (окрім фотодатчика «касета порожня») «закритий», визначте причину та усуньте помилку. Якщо помилку не вдається визначити та якщо «18» продовжує відображатися після наступного запуску тоді вертикальний модуль, диспенсор або контролер необхідно замінити.",
                'comment' => "В V-модулі або стекері закриті купюрами оптичні датчики (присутнє застрягання купюр), або є проблеми в роботі оптичних датчиків. Розбираємось по пунктам.
                <br><br>
                Якщо скод з'являється повторно після усунення застрягання банкнот - починаємо розбиратись. В зібраному стані не завжди можна виявити проблему, тому треба зняти стекер та V-модуля й все візуально передивитись.
                <br><br>
                1. V-модуля - можуть бути дуже розтягруті ремені або їх злітання з валів. Перевіряємо на шестернях цілісність зубці. Дивимось сторонні предмети (залишки касет, купюр), находження на місцях й чистоту оптичних датчиків, цілістність самого V-модуля. Обережно прокручуємо шестерні - нічого не повинно заважати.
                <br><br>
                2. Діагностуємо стекер. В стекері перевіряємо візуально ремені (їх легко побачити знизу), оптичні датчики. Головний двигун має також велике значення (для тестування виконайте функціональний тест 2 на контролері декілька разів).
                <br><br>
                3. Звертаємо увагу на корзину. Всі чотири великі шестерні легко обертаються (при знятій корзині) й надійно з'єднані з корзиною. Притискаючі всі чотири пружини на місці й їх направляючі тримачі не зламані (знаходяться зі сторони кріплення V-модулів). Корзина не має люфтів в пікерах - при необхідності трохи підтягнути по боках вусиками на з'єднаннях сторін (бували випадки коли саме це вирішувало проблему). Направляючі для касет не мають пошкоджень.
                <br><br>
                4. Самий рідкісний випадок - це контролера. Перевірити з'єдння з V-модулями. Зробити ініціалізацію фотодатчиків (дивись в меню - функціональні тести контролера).
                <br><br>
                5. Проблема може бути в касеті (можливе не спрацювання каретки притискання, це чютно при тестуваннях). Спробуйте іншу касету з банкнотами. Але це теж рідкісний випадок.
                <br><br>
                При виявленні проблем в описаних компонентах - робимо заміну й проводимо обов'язкове тестування."
            ],
            [
                "scode" => "19",
                "error" => "Несправний/заблокований кламп",
                "solution" => "Усуньте блокування клампу та вставте диспенсер  в сейф. Виконайте скидання. За потреби замініть стекер або контролер.",
                'comment' => "
                Проблема з рухом клампу або відбувається блокування його під час руху. Розбираємось по пунктам.
                <br><br>
                1. Якщо кламп не рухається або зупиняється під час руху -  перевірити підключення шлейфу клампа до роз'єм X13 контролера (синій ущільнювач на шлейфі в сторону стекера), а також зі сторони клампа. Ущільнювальні пластинки на кінцях шлейфа в роз'ємах обов'їязкові з обох сторін.
                <br><br>
                2. Перевірити візуально цілістність шлейфу - особливо біля клампа. Коли кламп знаходиться в позиції скидання в диверт-касету при тестуванні (наприклад другим функціональним тестом), то можна побачити місце залому шлейфа. Це часта причина коли кламп зупиняється в цій позиції з даним скодом.
                <br><br>
                3. Знос пластикових засувок по сторонам клампа - під час руху кламп розкривається й блокується подальший рух.
                <br><br>
                4. Проблема з редуктором чи двигунами клампу - при обертанні провідних шестернь або руху клампу чутно похрустування. Знос редуктора супроводжується наявністю золотистої стружки біля двигунів. Можуть бути перетягнуті болти по боках двигуна або двигун вже не видає необхідну потужність.
                <br><br>
                5. Якщо банкомат хольний - перевірте шляхи руху клампу в районі з'єднання презентора й стекера. При вставленні диспенсора в сейф можливе відскакування презентора від стекера. Презентер не фіксується, з'являється зазор в направляючей для руху клампа. Необхідно відрегулювати презентор двома болтами зверху.
                <br><br>
                6. Якщо присутній скод 23 - блокування можливе роутінг-дисками. Перевіряємо нижні пластини під клампом - вони повинні бути рівними.  
                <br><br>
                7. Якщо кламп стукається в шаттер й вертається декілька разів - перевірте що вулична частина атм задвинута й фіксуючі ручки помаранчевого кольору з обох сторін біля системного блоку підняті до верху. Перезасуньте диспенсор в сейф й перевірте його фіксування верхнім штоком. Перевірте на клампі наявність й чистоту трьох магнитів D, перепідключіть роз'єм презентора на контролері. Оберіть перший тест на контролері (скидання) й проведіть тестування знову. Майте на увазі, що якщо проблема з'явилась після заміни шаттера - переконайтесь що він відповідає версії атм - для 1500xe й 2050xe візуально вони схожі, але зверху оптика з різних сторін й шаттер не баче кламп.
                <br><br>
                8. В холодну пору - перевірити роботу штатного обігрівоча. Двигуни замерзають при низьких температурах.
                <br><br>
                Якщо при діагностиці й тестуванні були виявлені проблеми з клампом або стекером - виконайте заміну стекера, ініціалізування оптичних датчиків й тестування."
            ],
            [
                "scode" => "20",
                "error" => "Блокована/несправна стрілка вузла відбраковування (MA2/1, MA2/2, SM1)",
                "solution" => "Перевірте SAT у зоні стрілки вузла відбраковування на наявність застряглих банкнот/залишків банкнот та видаліть, якщо вони є. Перевірте рухливість перемикача стрілки вузла відбраковування, натиснувши та відпустивши ротор у підйомному магніті MA2. Виберіть функцію тестування 2 (механічне випробування) на функціональній кнопці та спостерігайте за активацією стрілки вузла відбраковування. Якщо підйомний магніт MA2 не рухається або рухається не повністю, SAT або контролер необхідно замінити. Якщо магніт рухається з повним ходом, то CMD-V4 можна знову ввести в експлуатацію. Якщо помилка виникає знову через короткий час й якщо причину не можна визначити після повторної перевірки стрілки вузла відбраковування, то SAT або контролер необхідно замінити.",
                'comment' => "
                Це карман відбракування й все що з ним пов'язано (двигун притискання SM1, прозора стрілка відбракування зверху, два електромагніта MA2/1, MA2/2). Розбираємось по пунктам. 
                <br><br>
                1. Перевірте можливе застрягання банкнот під стрілкою або в кармані й звільніть шляхи.
                <br><br>
                2. Виконайте функціональний тест 2 й перевірте візуально спрацювання соленоїдів MA2/1, MA2/2 - прозора стрілка відбракування зверху повинна характерно клацнути. Тест повинен завершитися без помилок.
                <br><br>
                3. Цей скод не завжди може виникати через проблеми з вузлом відбраковування. Якщо є скод 3x й атм сильно відбраковує, проблема може бути пов'язана з V-модулем. Потрібно визначити з якого пікера йде велике відбраковування та замінити його.
                <br><br>
                4. В крайньому випадку відключити вузол відбраковування на контролері - від'єднати роз'єми X12 й X17 та перезавантажити контролер по живленню. Стекер переходе працювати в режим без вузла відбракування й може надалі працювати без збоїв."
            ],
            [
                "scode" => "21",
                "error" => "Несправна вимірювальна станція (DDU)",
                "solution" => "Перевірте, чи немає заклинювання банкнот в зоні вимірювальної станції. Чи підключен вірно шлейф до контролера та чи не пошкоджений він? Якщо помилка залишається - заменіть вимірювальну станцію (DDU) або контролер.",
                'comment' => "
                1. Зніміть стекер й верхній V-модуль та перевірте - чи намає застрягання банкнот між вимірювальною станцією й стекером?
                <br><br>
                2. Перевірте, чи не злетіла з свого місця вимірювальна станція з обох сторін V-модуля.
                <br><br>
                3. Перевірте цілістність шлейфу й з'єднання шлейфу в ро'ємі до пластикового прозорого тримача - іноді достатньо обережно перепід'єднати роз'єм трохи зачистивши контакти. Будьте уважні - ущільнююча пластина шлейфа під'єднується в бік V-модуля.
                <br><br>
                4. В дуже рідких випадках проблема може бути у контролері."
            ],
            [
                "scode" => "22",
                "error" => "Несправний підсилювач фотодатчика або ініціалізація фотодатчика не вдалася",
                "solution" => "Перевірте всі шляхи руху банкнот від касет до клампа на наявність застряглих банкнот/залишків банкнот. Після цього поверніть CMD-V4 у сейф у положення видачі. Якщо після цього запуску індикатор стану знову показує '22', тоді необхідно замінити контролер.",
                'comment' => "
                Плавуюча помилка, після якої диспенсор виходить в робочий режим. Якщо помилка часто зустрічається, то проблема або в стекері або контролері.
                <br><br>
                В практиці були випадки коли в рішенні проблеми з скод 22 допомогла заміна вимірювальної станції."
            ],
            [
                "scode" => "23",
                "error" => "Роутинг-диск (SM2/SM3) несправний/заблокований",
                "solution" => "Якщо стекер не висувається з сейфа - виконайте скидання функціональною кнопкою контролера. Висуньте диспенсор й перевірте шляхи руху банкнот. Задвиньте диспенсор в сейф й виконайте тест 2 (тест механіки) функціональною кнопкою. Якщо скод 23 залишається - замініть стекер або контролер.",
                'comment' => "
                <br><br>
                Найбільший вплив на цей скод дає робота в тандемі зачепок клампа, роутінг-дисків й закриваючих клюшок під клампом біля пластин знизу. Розбираємось по пунктам.
                <br><br>
                1. Оберіть на контроллері функціональний тест 1 (скидання) й перевірте чи встане на місце кламп й роутінг-диски якщо вони були блоковані.
                <br><br>
                2. Висуваємо диспенсор й виставляємо роутинг-диски у правильному положенні (якщо вони це не зробили від час скидання). Іноді треба трохи розуміння як рухається кламп по направляючим стрілкам щоб його розбловкувати й повернути на місце.Зверніть увагу - роутінг-диски працюють сумісно з клюшками знизу клампа, які закривають кламп за зачіпку. Можливо при закриванні клампа клюшка пролетіла за зачіпку й її треба обережно повернути на місце обертаючи роутінг-диск.
                <br><br>
                3. Перевіте зачіпки клампа - вони повинні спрацювувати при закриванні клампа нижніми клюшкаи під час обертання роутінг-дисків.
                <br><br>
                4. Перевірити пластини під клампом (вони повинні бути однаково рівними).
                <br><br>
                5. Бувають випадки, коли роз'єм на контролері X33 (дивись меню - схема контролера) під'єднаний іншою стороною (два провода повинні бути лівіше на роз'ємі) або взагалі не під'єднаний. Це приводить при вмиканні диспенсора одразу до скод 23.
                <br><br>
                При виявленні проблем з стекером або клампом - виконайте його заміну з обов'язковою ініціалізацією оптичних датчиків й тестуванням. Цей скод дуже добре тестуєтьтся функціональним тестом 2."
            ],
            [
                "scode" => "24",
                "error" => "Реджект/ретракт привід (підйомний магніт) несправний/заблокований (MA6)",
                "solution" => "Вибір жолоба відхилення/відведення в реджект/ретракт касеті не вдалося встановити правильно. Вийміть реджект/ретракт касету та перевірте рухливість блоку відведення в касеті. Перевірте роз'єми на контролері CMD та на підйомному магніті MA6 на правильність посадки. Перевірте фотодатчик на перемикальному важелі на фіксацію посадки. Перемістіть CMD-V4 у сейфі в положення видачі (запобіжний вимикач замкнений). Знову вставте касету та виберіть функцію тестування 2 (механічне випробування) за допомогою функціональної клавіші та контролюйте рух приводу реджект/ретракт касети (MA6). Якщо підйомний магніт не рухається або якщо кінцеві положення важеля не досягнуто (індикація стану 24 ще раз), тоді SAT або контролер CMD необхідно замінити.",
                'comment' => "
                <br><br>
                Це робота в тандемі контролера, електромагніта, ричага перемикання реджект-ретракт в диверт-касеті який рухає електромагніт, оптичної пари положення ричага. Розбираємось по пунктам.
                <br><br>
                1. Знімаємо контролер з стекера. Під контролером зі сторони диверт-касети знаходиться електомагніт, ричаг перемикання й оптичка пара. Перевіряємо все щоб було на своїх місцях (все має швидкоз'ємне фіксування й може злетіти). Обов'язково необхідно перевірити щоб ричаг вільно рухався й був зачеплений з електрромагнітом. Електромагніт не повинен підклінювати й легко пружиною вертатися в своє положення.
                <br><br>
                2. Перевіряємо всі електричні з'єднання електромагніта й оптичної пари до контролера.
                <br><br>
                3. Збираємо все й виконуємо декілька разів функціональний тест 2. Перевіряємо як спрацьовує електромагніт під час тестування - він повинени характерно клацнути. Якщо помилок немає - виконуємо аналогічне тестування з диверт-касетою (щоб виключити проблему з касетою).
                <br><br>
                4. Найчастіші проблеми це або непрацюючий електромагніт, зсування з свого положення елементів або проблема в контролері.
                "
            ],
            [
                "scode" => "25",
                "error" => "Головний двигун (DCM 1) несправний / заблокований",
                "solution" => "Головний двигун (DCM 1) більше не може бути доведений до своєї мінімальної швидкості обертання після короткого часу запуску. Виберіть 1 (скидання) на функціональній клавіші. Двигун намагається запуститися, але чутні лише утруднені робочі шуми: перевірте шляхи проходження банкнот CMD-V4 на наявність значного застрягання банкнот. Чи не злетіли ремені вертикальних модулів? Перевірте вхід у касету RR, щоб побачити, чи там застрягли банкноти. Перемістіть CMD-V4 у сейфі в положення видачі (запобіжний вимикач закритий) та виберіть функцію 2 (механічний тест) на функціональній клавіші після запуску CMD-V4: спостерігайте за робочими шумами та функцією транспортування головного двигуна. Якщо головний двигун не обертається або якщо ця тестова функція знову завершується з відображенням стану 25 - стекер, в-модуль або контролер необхідно замінити.",
                'comment' => "Головний двигун не взмозі крутити систему транспортування. Розбираємось по пунктам.
                <br><br>
                1. Знімаємо з корзини стекер та V-модуля й усуваємо застрягання по всіх путях транспортування. Будьте уважні - запам'ятовуйте місця застрягань - це допоможе в майбутньому вірно діагностувати проблемний модуль.
                <br><br>
                2. Важливо перевірити на корзині всі чотири великі шестерні. Вони повинні бути добре з'єднані з корзиною, вільно рухатись й не зламані. Також перевіряємо одразу цілістність всіх інших компонентів (притискаючих пружин з тримачами й направляючих касет). Коли виникає застрягання в V-модулях головний двигун може дуже легко зламати будь яку шестерню.
                <br><br>
                3. Перевіряємо цілістність всіх шестерень на V-модулях. Ремені повинні бути на місці. Легко обертаємо шестерні й перевіряємо що нічого не заважає. Будьте уважні - можливо попадання в модуля частинок від касет, резинок від банкнот та інших предметів.
                <br><br>
                4. Після перевірки всіх V-модулів - встановлюємо їх в корзину й після фіксування кожного V-модуля обертаємо обережно шестернями транспорт - нічого не повинно заважати руху.
                <br><br>
                5. Запускаємо диспенсор. Обираємо функціональний тест 2 (тест механіки) й уважно слухаємо й дивимось за роботою транспортної системи. Проводимо тестування на видачу за допомогою тестової касети (при скодах 25 є випадки обривання зчеплення V-модулів).
                <br><br>
                6. Якщо після усунення застрягань й завантаження банкомата іншими касетами або тестуванні іншою касетою (виключаємо таким чином проблеми з касетами) виникає знову скод 25 - міняємо V-модуль або стекер (не виключаємо проблему в роботі головного двигуна)."
            ],
            [
                "scode" => "26",
                "error" => "Привід колеса відсіку збору (SM 9) несправний/заблокований",
                "solution" => "Перевірте SAT у зоні відсіку для збору на наявність застряглих банкнот/залишків банкнот та видаліть їх, якщо вони є. Перемістіть CMD-V4 у сейф в положення видачі (запобіжний вимикач замкнений) та виберіть текстову функцію 2 (механічний тест) за допомогою функціональної клавіші після запуску CMD-V4: якщо ця тестова функція знову завершується з відображенням статусу 26, тоді SAT або контролер необхідно замінити.",
                "comment" => "
                1. Значне застрягання в районі гребінки яка налістує банкноти в кламп. Перевірити весь шлях руху банкнот на наявність застрягань та сторонніх предметів.
                <br><br>
                2. Положення гребінки контролюється двома датчиками зліва. Перевірити їх чистоту, кріплення й під'єднання до контролера. Для цього необхідно зняти контролер.
                <br><br>
                3. Якщо після перевірки всіх компонентів виникає знову скод 26 - міняємо стекер або контролер, проводимо іниіціалізацію датчиків й виконуємо тестування за допомогою функції 2 контролера (тест механіки) та на видачу банкнот.
                "
            ],
            [
                "scode" => "28",
                "error" => "Несправність шаттера",
                "solution" => "Перевірте шаттер на наявність сторонніх предметів, які перешкоджають руху шторки. Перемістіть CMD-V4 у сейф в положення видачі (запобіжний вимикач замкнений) та виберіть тестову функцію 2 (механічний тест) за допомогою функціональної клавіші та контролюйте рух шторки. Якщо вона намагається відкритись але безуспішно або тестування завершується знову з індикацією стану 28, тоді шаттер або контролер необхідно замінити.",
                'comment' => "Механічна несправніть шаттера. Розбираємось по пунктам.
                <br><br>
                1. Шліцьовою викруткою перевести шаттер в положення розблакований (з внутрішньої сторони шаттера зліва провернути до познвчки розблокований) й перевірити чи вільно рухається шторка - чи не зачипає ничого при відкритті.
                <br><br>
                2. Повертаємо шаттер в положення закритий й скидуємо помилку функціональним тестом 1 (скидання) на контролері або перезадвинути диспенсор що аналогічно данному тесту. Іноді необхідно перезавантажити банкомат.
                <br><br>
                3. Проводимо тестування на видачу. Якщо шторка хоть трохи смикається при підніманні або взагалі не відкриває - міняємо шаттер.
                <br><br>
                4. При замінін шаттера обов'язково вимикаємо або банкомат або контролер.
                <br><br>
                5. Робимо заміну шаттера.
                <br><br>
                6. Після заміни вмикаємо банкомат або контролер й виконуємо обов'язково ініціалізацію оптичних датчиків (на різних шатерах оптика може відрізнятись) функціональним тестом 8 (дивись меню - функціональні тести контролера) або через программу TSOP -> Start -> Devices -> Cash Dispenser -> Test Functions -> Intern / Self test > init PS.
                <br><br>
                7. Після ініціалізації скидаємо помилку функціональним тестом 1 (скидання) на контролері або перезасунути диспенсор що аналогічно данному тесту.
                <br><br>
                8. Проводемо тестування на видачу й роботу шаттера."
            ],
            [
                "scode" => "29",
                "error" => "Несправність шаттера (закрит оптичний датчик)",
                "solution" => "Перевірте презентер та шаттер на наявність сторонніх предметів, які перешкоджають роботі вихідного фотодатчика. Перевірте роз'єм на CMD-V4 на правильність підключення. Перемістіть CMD-V4 у сейф у положення видачі та виберіть 1 (скидання) за допомогою функціональної клавіші. Виконайте ініціалізацію фотодатчиків. Якщо після запуску знову відображається 29, то шаттер, SAT або контролер необхідно замінити.",
                "comment" => "
                Оптичні датчики на шаттері закриті, забруднені пилом, несправні або не виконана їх ініціалізаця. Розбираємось по пунктам.
                <br><br>
                1. Можливо є застрагання банкнот в шаттері.
                <br><br>
                2. Продути й протерти оптопари шаттера.
                <br><br>
                3. Перепідключити шаттер в роз'ємі Х2 на вимкнутому контролері (дивись меню - схема контролера) якщо є доступ до диспенсора.
                <br><br>
                4. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера) або через программу TSOP -> Start -> Devices -> Cash Dispenser -> Test Functions -> Intern / Self test > init PS.
                <br><br>
                5. Скидаємо помилку функціональним тестом 1 (скидання) на контролері або перезасунути диспенсор що аналогічно данному тесту.
                <br><br>
                6. Проводемо тестування на видачу й роботу шаттера.
                <br><br>
                7. Якщо помилка залишається - робимо заміну шаттера. Будьте уважні - заміна шаттера виконується при вимкнутому банкоматі або контролері. 
                <br><br>
                8. Після заміни шаттера обов'язково повторюємо пунки 4, 5, 6."
            ],
            [
                "scode" => "3x",
                "error" => "Загато збоїв при виведенні банкнот із касети X",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                <br>
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи правильного виду банкноти знаходяться у касеті? Чи вірно налаштовані розміри під банкноти?
                <br>
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                <br>
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                <br>
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                <br>
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 3x продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "31",
                "error" => "Загато збоїв при виведенні банкнот із першої касети",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                <br>
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи правильного виду банкноти знаходяться у касеті? Чи вірно налаштовані розміри під банкноти?
                <br>
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                <br>
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                <br>
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                <br>
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 31 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "32",
                "error" => "Загато збоїв при виведенні банкнот із другої касети",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                <br>
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи правильного виду банкноти знаходяться у касеті? Чи вірно налаштовані розміри під банкноти?
                <br>
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                <br>
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                <br>
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                <br>
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 32 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "33",
                "error" => "Загато збоїв при виведенні банкнот із третьої касети",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                <br>
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи правильного виду банкноти знаходяться у касеті? Чи вірно налаштовані розміри під банкноти?
                <br>
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                <br>
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                <br>
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                <br>
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 33 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "34",
                "error" => "Загато збоїв при виведенні банкнот із четвертої касети",
                "solution" => "Відхилення пачок може бути спричинене перекошеними банкнотами або банкнотами, які витягуються неконтрольованим чином, або проблемами з фотодатчиками. Цю помилку можна ігнорувати під час першого виникнення (попередження). Якщо помилка вже виникла, будь ласка, виконайте такі дії:
                <br>
                1. Вийміть касету з пікера та перевірте укладання банкнот в касеті: чи деформовані лицьові сторони банкнот з одного боку? Рівномірний тиск лицьових сторін банкнот з правого та лівого боків? Чи правильного виду банкноти знаходяться у касеті? Чи вірно налаштовані розміри під банкноти?
                <br>
                2. Після виймання касети перевірте зону в вертикальному модулі на наявність застряглих залишків банкнот.
                <br>
                3. Перевірте шлях транспортування від касети до відділення для укладання, на наявність застряглих банкнот/залишків банкнот. Чи зійшов транспортний ремінь з роликів вертикального модуля?
                <br>
                4. Перевірте роз'єми на контролері CMD на окремих елементах фотодатчиків на правильність посадки.
                <br>
                5. Перевірте хід магніту для утримуючого вала на наявність повільного руху, натиснувши на ротор (або перевірте рух магніту за допомогою тестової функції 2 (механічний тест)).
                Якщо ці тести не виявлять помилок і якщо статус 34 продовжує відображатися, тоді відповідний вертикальний модуль або контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "4x",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для касети X",
                "solution" => "A). Не вдалося витягнути банкноту з касети X Б). Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                <br>
                Порядок дій у випадку A:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                <br>
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                <br>
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                <br>
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 4x, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                <br>
                Порядок дій у випадку Б:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                <br>
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 4x з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                <br>
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                <br>
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити.",
                "comment" => "Одна з причин - обрив зчеплення V-модуля"
            ],
            [
                "scode" => "41",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для першої",
                "solution" => "A). Не вдалося витягнути банкноту з касети X Б). Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                <br>
                Порядок дій у випадку A:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                <br>
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                <br>
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                <br>
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 41, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                <br>
                Порядок дій у випадку Б:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                <br>
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 41 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                <br>
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                <br>
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити.",
                "comment" => "Одна з причин - обрив зчеплення V-модуля"
            ],
            [
                "scode" => "42",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для другої касети",
                "solution" => "A). Не вдалося витягнути банкноту з касети X Б). Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                <br>
                Порядок дій у випадку A:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                <br>
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                <br>
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                <br>
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 42, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                <br>
                Порядок дій у випадку Б:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                <br>
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 42 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                <br>
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                <br>
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити.",
                "comment" => "Одна з причин - обрив зчеплення V-модуля"
            ],
            [
                "scode" => "43",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для третьої касети",
                "solution" => "A). Не вдалося витягнути банкноту з касети X Б). Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                <br>
                Порядок дій у випадку A:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                <br>
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                <br>
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                <br>
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 43, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                <br>
                Порядок дій у випадку Б:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                <br>
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 43 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                <br>
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                <br>
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити.",
                "comment" => "Одна з причин - обрив зчеплення V-модуля"
            ],
            [
                "scode" => "44",
                "error" => "Виведення банкнот неможливе або неправильне притискне зусилля для четвертої касети",
                "solution" => "A). Не вдалося витягнути банкноту з касети X Б). Не вдалося створити необхідний контактний тиск під час вставлення касет всередину.
                <br>
                Порядок дій у випадку A:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи є передні банкноти надзвичайно деформованими? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до каретки тиску! Чи є передні банкноти липкими або зачепленими одна за одну з перегинами?
                <br>
                2. Після виймання касети, перевірте область вертикального модуля на наявність застряглих банкнот/залишків банкнот.
                <br>
                3. Перевірте роз'єми на контролері CMD та правильність посадки вертикального модуля.
                <br>
                4. Після цього помістіть заповнену касету в пікер та виберіть 3 (пробний процес вилистування з касети) на функціональній кнопці. Якщо цей тест знову завершиться з кодом помилки 44, виберіть пробний процес вилистування ще раз, перевіривши при цьому функцію муфти та утримуючого вала. Якщо муфта або утримуючий магніт не активуються, вертикальний модуль або контролер необхідно замінити.
                <br>
                Порядок дій у випадку Б:
                <br>
                1. Вийміть касету та перевірте укладання банкнот: банкноти повинні стояти вертикально в касеті. Чи передня сторона банкнот надзвичайно деформована? Якщо банкноти вигнуті, то зовнішній вигин має бути спрямований до притискної каретки! За необхідності розміщуйте банкноти з задньої частини касети вперед. Якщо стопка банкнот сильно треться об бічні напрямні для банкнот (банкноти, що виступають збоку, загнуті назад), то стопку банкнот потрібно краще вирівняти.
                <br>
                2. Вставте касету назад. Чи чутно рухається каретка тиску вперед при цьому? Якщо шуму не чути, перевірте роз'єми на контролері CMD та роз'єми на касеті на правильність посадки. Проведіть тест з іншою касетою. Якщо двигун все ще не працює,то контролер несправний. Якщо шум двигуна чути, але повідомлення про помилку 44 з'являється знову через кілька секунд (разом з триразовим звуковим сигналом), тоді вийміть касету та перевірте хід дозаторного вала вручну на наявність повільного руху. Вийміть касету, відкрийте її, перемістіть вручну в положення для дозування. Перевірте рух зворотної штанги на наявність повільного руху.
                <br>
                3. Якщо причину не виявлено і якщо ця помилка також виникає з іншою касетою в цьому вертикальному модулі, то якість датчика тиску необхідно перевірити за допомогою тестової програми та команди самотестування «Запит стану тиску контакту касети»(DYQ).
                <br>
                Якщо помилка присутня, тоді вертикальний модуль або контролер необхідно замінити.",
                "comment" => "Одна з причин - обрив зчеплення V-модуля"
            ],
            [
                "scode" => "5x",
                "error" => "Забагато дефектних банкнот з касети X",
                "solution" => "Під час видачі банкнот з касети X було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 5x виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер.",
                "comment" => "Одна з причин - злітання ремня V-модуля"
            ],
            [
                "scode" => "51",
                "error" => "Забагато дефектних банкнот з першої касети",
                "solution" => "Під час видачі банкнот з першої касети було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 51 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер.",
                "comment" => "Одна з причин - злітання ремня V-модуля"
            ],
            [
                "scode" => "52",
                "error" => "Забагато дефектних банкнот з другої касети",
                "solution" => "Під час видачі банкнот з другої касети було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 52 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер.",
                "comment" => "Одна з причин - злітання ремня V-модуля"
            ],
            [
                "scode" => "53",
                "error" => "Забагато дефектних банкнот з третьої касети",
                "solution" => "Під час видачі банкнот з третьої касети було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 53 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер.",
                "comment" => "Одна з причин - злітання ремня V-модуля"
            ],
            [
                "scode" => "54",
                "error" => "Забагато дефектних банкнот з четвертої касети",
                "solution" => "Під час видачі банкнот з четвертої касети було виявлено забагато подвійних або надмірно широких або надмірно вузьких банкнот. Вийміть касету та перевірте, чи в неї розміщено правильний тип банкноти. Перевірте банкноти на наявність деформацій або липкості. Знову вставте касету та перезапустіть програму. Якщо багато «хороших» банкнот виключено за допомогою функції «відбракування» або якщо помилка 54 виникає знову через короткий час, тоді для цього типу банкнот слід виконати нове визначення опорного значення.
                Якщо помилку не вдається усунути, тоді необхідно замінити блок видачі або контролер.",
                "comment" => "Одна з причин - злітання ремня V-модуля"
            ],
            [
                "scode" => "6x",
                "error" => "Касета X несправна",
                "solution" => "Дані банкнот, що зберігаються в касеті X, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "61",
                "error" => "Перша касета несправна",
                "solution" => "Дані банкнот, що зберігаються в першій касеті, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "62",
                "error" => "Друга касета несправна",
                "solution" => "Дані банкнот, що зберігаються в другій касеті, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "63",
                "error" => "Третя касета несправна",
                "solution" => "Дані банкнот, що зберігаються в третій касеті, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "64",
                "error" => "Четверта касета несправна",
                "solution" => "Дані банкнот, що зберігаються в четвертій касеті, не вдалося прочитати та/або перезаписати (помилка запису в EEPROM касети). Перевірте правильність підключення роз'ємів на контролері CMD та роз'ємів на касеті. Якщо помилка також виникає з іншою касетою в цьому вертикальному модулі, тоді контролер необхідно замінити.",
                'comment' => null
            ],
            [
                "scode" => "70",
                "error" => "Вимірювальна станція (DDU) не готова до роботи",
                "solution" => "Перевірте, чи немає застрягання в зоні вимірювальної станції. Чи підключені кабелі? Замініть вимірювальну станцію DDU або контролер.",
                'comment' => null
            ],
            [
                "scode" => "7x",
                "error" => "Датчик видачі брудний або датчик тиску несправний",
                "solution" => "A) Якщо касету можна встановити в позицію касети X без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик - датчик видачі в блоці видачі X (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо ініціалізувати касету в позиції касети X (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити.",
                'comment' => 'Іноді незаізольовані контакти вертикального контролера в флешці пробиває на корпус корзини - мікросхема відповідного пикера на вертикалльному контроллері буде мати ознаки підпалення.'
            ],
            [
                "scode" => "71",
                "error" => "Датчик видачі брудний або датчик тиску несправний",
                "solution" => "A) Якщо касету можна встановити в позицію першої касети без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик - датчик видачі в блоці видачі X (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо ініціалізувати касету в позиції першої касети (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити.",
                'comment' => 'Іноді незаізольовані контакти вертикального контролера в флешці пробиває на корпус корзини - мікросхема відповідного пикера на вертикалльному контроллері буде мати ознаки підпалення.'
            ],
            [
                "scode" => "72",
                "error" => "Датчик видачі брудний або датчик тиску несправний",
                "solution" => "A) Якщо касету можна встановити в позицію другої касети без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик - датчик видачі в блоці видачі X (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо ініціалізувати касету в позиції другої касети (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити.",
                'comment' => 'Іноді незаізольовані контакти вертикального контролера в флешці пробиває на корпус корзини - мікросхема відповідного пикера на вертикалльному контроллері буде мати ознаки підпалення.'
            ],
            [
                "scode" => "73",
                "error" => "Датчик видачі брудний або датчик тиску несправний",
                "solution" => "A) Якщо касету можна встановити в позицію третьої касети без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик - датчик видачі в блоці видачі X (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо ініціалізувати касету в позиції третьої касети (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити.",
                'comment' => 'Іноді незаізольовані контакти вертикального контролера в флешці пробиває на корпус корзини - мікросхема відповідного пикера на вертикалльному контроллері буде мати ознаки підпалення.'
            ],
            [
                "scode" => "74",
                "error" => "Датчик видачі брудний або датчик тиску несправний",
                "solution" => "A) Якщо касету можна встановити в позицію четвертої касети без помилки (одноразовий звуковий сигнал), то повідомлення про помилку вказує на надзвичайно забруднений фотодатчик - датчик видачі в блоці видачі X (PSDx) який необхідно очистити. Після цього виконайте скидання (перемістіть CMD-V4 у позицію видачі).
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.
                B) Якщо неможливо ініціалізувати касету в позиції четвертої касети (немає звукового сигналу навіть через кілька секунд), то вертикальний модуль або контролер необхідно замінити.",
                'comment' => 'Іноді незаізольовані контакти вертикального контролера в флешці пробиває на корпус корзини - мікросхема відповідного пикера на вертикалльному контроллері буде мати ознаки підпалення.'
            ],
            [
                "scode" => "8x",
                "error" => "Датчик порожньої касети PSEx брудний",
                "solution" => "Очистіть фотодатчик «PSEx» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                'comment' => 'Можлива проблема з фотодатчиками порожньої касети відповідного пікера або контролером. Якщо чистка фотодатчиків не допомогла - замінити V-модуль, виконати іниціалізацію фототодатчиків (тест 8).'
            ],
            [
                "scode" => "81",
                "error" => "Датчик порожньої касети PSE1 брудний",
                "solution" => "Очистіть фотодатчик «PSE1» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                'comment' => 'Можлива проблема з фотодатчиками порожньої касети відповідного пікера або контролером. Якщо чистка фотодатчиків не допомогла - замінити V-модуль, виконати іниціалізацію фототодатчиків (тест 8).'
            ],
            [
                "scode" => "82",
                "error" => "Датчик порожньої касети PSE2 брудний",
                "solution" => "Очистіть фотодатчик «PSE2» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                'comment' => 'Можлива проблема з фотодатчиками порожньої касети відповідного пікера або контролером. Якщо чистка фотодатчиків не допомогла - замінити V-модуль, виконати іниціалізацію фототодатчиків (тест 8).'
            ],
            [
                "scode" => "83",
                "error" => "Датчик порожньої касети PSE3 брудний",
                "solution" => "Очистіть фотодатчик «PSE3» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                'comment' => 'Можлива проблема з фотодатчиками порожньої касети відповідного пікера або контролером. Якщо чистка фотодатчиків не допомогла - замінити V-модуль, виконати іниціалізацію фототодатчиків (тест 8).'
            ],
            [
                "scode" => "84",
                "error" => "Датчик порожньої касети PSE4 брудний",
                "solution" => "Очистіть фотодатчик «PSE4» у відповідному вертикальному модулі та відповідну призму в притискному каретці касети. Після цього виконайте скидання (перемістіть CMD-V4 у положення видачі). Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): Фотодатчики, які мають стан «3» або вище, слід очистити. Покращення стану можна запитати після скидання.
                Примітка: після першого виникнення цієї помилки CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                "comment" => "Можлива проблема з фотодатчиками порожньої касети відповідного пікера або контролером. Якщо чистка фотодатчиків не допомогла - замінити V-модуль, виконати іниціалізацію фототодатчиків (тест 8)."
            ],
            [
                "scode" => "90",
                "error" => "Фотодатчик PS1 брудний",
                "solution" => "Обережно очистіть передавальні та приймальні діоди між колесами укладача за допомогою м'якої щітки, ватних паличок або стисненого повітря. Поверніть CMD-V4 у положення для видачі. Якщо на дисплеї стану продовжується відображати код помилки '90' після запуску (скидання), вийміть SAT та очистіть поверхні призми знизу, між колесами укладача, поверніть CMD-V4 у положення для видачі.
                Якщо на дисплеї стану продовжує відображатися код помилки '90' після запуску (скидання), тоді SAT необхідно замінити. Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування 'DYK' (Запит стану фотодатчиків, підсилювачів фотодатчиків). Фотодатчики, які мають стан '3' або вище, необхідно очистити. Покращення стану можна досягти після повторної ініціалізації фотодатчиків.
                Примітка: після першого виникнення цієї помилки, CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена, при подальшому зростанні забруднення.",
                "comment" => "Часто пил осідає на парі фотодатчиків, які знаходитьтся під грибінкою. Достатньо видути з них пил або ватними палочками протерти призми. В деяких випадках необхідно протерти пил на внутришній стороні призми. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера)."
            ],
            [
                "scode" => "91",
                "error" => "Фотодатчик PS18 забруднений ",
                "solution" => "Фотодатчик PS18 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (cкидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '91', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                "comment" => "Цей фотодатчик знаходиться між грибінкою та клампом знизу й дивиться по діагонали на зворотній фотодатчик в сторону диверт-касети. Необхідно протерти їх ватними палочками або видути пил. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера)"
            ],
            [
                "scode" => "93",
                "error" => "Фотодатчик PS2 забруднений",
                "solution" => "Фотодатчик PS2 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у положення видачі та чекайте запуску або виберіть «1» (скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '93', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                "comment" => "Це пара фотодатчиків, які знаходяться у відсіку відбракування (кармані). Необхідно протерти їх з двох сторін ватними палочками або видути пил. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера)"
            ],
            [
                "scode" => "95",
                "error" => "Фотодатчик PS27 забруднений",
                "solution" => "Фотодатчик PS27 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '95', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                "comment" => "Це фотодатчик на шаттері - перший від шторки. Розбираємось по пунктам.
                1. Почистити фотодатчики шаттера.
                <br><br>
                2. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера) або через программу TSOP -> Start -> Devices -> Cash Dispenser -> Test Functions -> Intern / Self test > init PS.
                <br><br>
                3. Скидаємо помилку функціональним тестом 1 (скидання) на контролері або перезасунути диспенсор що аналогічно данному тесту.
                <br><br>
                4. Проводемо тестування на видачу й роботу шаттера.
                <br><br>
                5. Якщо помилка залишається - робимо заміну шаттера. Будьте уважні - заміна шаттера виконується при вимкнутому банкоматі або контролері. 
                <br><br>
                6. Після заміни шаттера обов'язково повторюємо пунки 2, 3, 4." 
            ],
            [
                "scode" => "9A",
                "error" => "Фотодатчик PS28 забруднений (контроль заднего края пачки банкнот)",
                "solution" => "Фотодатчик PS28 забруднений і терміново потребує очищення. Видаліть відкладення пилу на поверхнях відповідного передавача/приймача (елементи з прозорим або фіолетовим пластиковим корпусом) та, за потреби, з відповідної призми (дві кришталево прозорі поверхні навпроти передавача/приймача) за допомогою м'якої щітки, ватних паличок або стисненого повітря.
                Після очищення поверніть CMD-V4 у вихідне положення та чекайте запуску або виберіть «1» (Скидання) на функціональній кнопці.
                Перевірте ступінь забруднення всіх фотодатчиків у KDIAG за допомогою тестової програми за допомогою команди самотестування «DYK» (Запит стану фотодатчиків, підсилювачів фотодатчиків): фотодатчики, які мають стан «3» або вище, необхідно очистити.
                Покращення стану можна досягти після повторної ініціалізації фотодатчиків. 
                Примітка: Після першого появи коду помилки '9A', CMD-V4 може продовжувати працювати, доки операція не буде автоматично зупинена при подальшому зростанні забруднення.",
                "comment" => "Це фотодатчик на шаттері - другий від шторки. Розбираємось по пунктам.
                1. Почистити фотодатчики шаттера.
                <br><br>
                2. Виконати ініціалізацію оптичних датчиків функціональним тестом 8 (дивись меню - функціональні тести контролера) або через программу TSOP -> Start -> Devices -> Cash Dispenser -> Test Functions -> Intern / Self test > init PS.
                <br><br>
                3. Скидаємо помилку функціональним тестом 1 (скидання) на контролері або перезасунути диспенсор що аналогічно данному тесту.
                <br><br>
                4. Проводемо тестування на видачу й роботу шаттера.
                <br><br>
                5. Якщо помилка залишається - робимо заміну шаттера. Будьте уважні - заміна шаттера виконується при вимкнутому банкоматі або контролері. 
                <br><br>
                6. Після заміни шаттера обов'язково повторюємо пунки 2, 3, 4."
            ]
        ];

        DB::table('scode_list_scodes')->insert($data);
    }
}
